index.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title><b>EuLisp</b></title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-07-01 12:03:12 BST"/>
<meta name="author" content="nil"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title"><b>EuLisp</b></h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Copyright </a></li>
<li><a href="#sec-2">2 Aim </a></li>
<li><a href="#sec-3">3 General Description </a></li>
<li><a href="#sec-4">4 Documentation </a></li>
<li><a href="#sec-5">5 Installation </a></li>
<li><a href="#sec-6">6 Getting Started with Youtoo </a></li>
<li><a href="#sec-7">7 Getting Started with EuXLisp </a></li>
<li><a href="#sec-8">8 To Do </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <a href="COPYING">Copyright</a> </h2>
<div class="outline-text-2" id="text-1">

<p>EuLisp is free software: you can redistribute it and/or modify it under the
terms of the GNU General Public License as published by the Free Software
Foundation, either version 3 of the License, or (at your option) any later
version.
</p>
<p>
EuLisp is distributed in the hope that it will be useful, but WITHOUT ANY
WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR
A PARTICULAR PURPOSE.  See the GNU General Public License for more details.
</p>
<p>
You should have received a copy of the GNU General Public License along with
EuLisp in the file <a href="COPYING">COPYING</a>.  If not, see
<a href="http://www.gnu.org/licenses/">http://www.gnu.org/licenses/</a>.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Aim </h2>
<div class="outline-text-2" id="text-2">

<p>This version of the EuLisp definition and Youtoo and EuXLisp implementations
are being developed in an attempt to reconcile the differences with the
ultimate aim to create a consistent definition and implementations which are
as close to EuLisp-1.0 as is possible to ascertain from the remaining
documents related to the standardisation process:
</p><ul>
<li id="sec-2.1">Youtoo original sources <br/>
This release of Youtoo started life as
<a href="http://www.cs.bath.ac.uk/~jap/EuLisp/youtoo/youtoo0.93.tar.gz">Youtoo-0.93</a>
developed by Andreas Kind, Julian Padget and others.  More details are
available from the original <a href="README.orig">README</a> file and
<a href="http://www.cs.bath.ac.uk/~jap/ak1/youtoo/">the youtoo home page</a>.  The
<i>b2h</i> and <i>i2doc</i> tools needed to bootstrap youtoo were reverse engineered
and provided by
<a href="http://unwind-protect.org/~tkb/software.html#youtoo-and-eulisp-definition">T. Kurt Bond</a>.
</li>
<li id="sec-2.2">EuXLisp original sources <br/>
EuXLisp started life as
<a href="http://www.bath.ac.uk/~masrjb/Sources/euscheme.html">Euscheme</a> based on
xscheme written by David Michael Betz and released under the 3-clause BSD
licence, see <a href="EuXLisp/ORIGINAL_LICENCE">file:EuXLisp/ORIGINAL_LICENCE</a>.  However with the inclusion
of the GNU getopt and readline libraries this software inherits the GPL with
which the 3-clause BSD licence is compatible and all further developments
will be made under the terms of the GPL version 3, see
<a href="COPYING">COPYING</a>.
</li>
<li id="sec-2.3">EuLisp definition original sources <br/>
The version of the EuLisp definition supplied is this release of Youtoo
started life as EuLisp-0.99 from the pack released by Julian Padget:
<a href="ftp://ftp.bath.ac.uk/pub/eulisp/definition/931202.tar.gz">931202.tar.gz</a> updated following proposals and discussions also released by
Julian Padget:
<ul>
<li>
<a href="http://people.bath.ac.uk/masjap/EuLisp/">Online definition</a>
</li>
<li>
<a href="ftp://ftp.bath.ac.uk/pub/eulisp/mail/nov93.gz">nov93.gz</a>
</li>
<li>
<a href="ftp://ftp.bath.ac.uk/pub/eulisp/mail/dec93.gz">dec93.gz</a>
</li>
<li>
<a href="ftp://ftp.bath.ac.uk/pub/eulisp/WG/adv-genarith.ps.gz">adv-genarith.ps.gz</a>
</li>
<li>
<a href="ftp://ftp.bath.ac.uk/pub/eulisp/WG/eulisp-ffi.ps.gz">eulisp-ffi.ps.gz</a>
</li>
<li>
<a href="ftp://ftp.bath.ac.uk/pub/eulisp/WG/eulisp-proposals.ps.gz">eulisp-proposals.ps.gz</a>
</li>
<li>
<a href="ftp://ftp.bath.ac.uk/pub/eulisp/WG/genarith.ps.gz">genarith.ps.gz</a>
</li>
<li>
<a href="ftp://ftp.bath.ac.uk/pub/eulisp/WG/map.ps.gz">map.ps.gz</a>
</li>
<li>
<a href="ftp://ftp.bath.ac.uk/pub/eulisp/WG/stream.ps.gz">stream.ps.gz</a>

</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> General Description </h2>
<div class="outline-text-2" id="text-3">

<ul>
<li id="sec-3.1">Youtoo <br/>
The Youtoo system is a public domain implementation of the object-oriented
dynamic programming language EuLisp. EuLisp is a single-valued dialect of
Lisp with an integrated object system, a defined meta-object protocol,
modules and a simple light-weight process mechanism (threads).

<p>
The Youtoo compiler/interpreter compiles EuLisp into C-embedded virtual
machine code which can be statically or dynamically linked with the virtual
machine, the conservative garbage collector, the EuLisp language library and
arbitrary other Lisp and foreign code (C, C++ and Fortran). Resulting
stand-alone executables are portable, interoperable and efficient (see The
Lisp Performance Page). The language implementation is extended towards a
Virtual Multicomputer Architecture. Object serialization and inter-process
communication (Sockets, MPI, Harvest Object Cache) support the migration of
arbitray data and code.
</p>
<p>
The system reuses ideas from the Oaklisp system written by Barak Pearlmutter
and Kevin Lang. The meta-object protocol (<code>Telos</code>) was originally
implemented in Common Lisp by Russell Bradford. By default, a garbage
collector written by Hans Boehm and Alan Demers is used.
</p></li>
<li id="sec-3.2">EuXLisp <br/>
EuXLisp is a simple EuLisp Level 0 interpreter.  EuLisp Level 0 is a small
and compact Lisp, but nevertheless has many interesting features, such as
modules, an object system, and multithreading.  EuLisp Level 1 has extra
features, the most notable being a full metaobject system which is
implemented in Youtoo not in EuXLisp.

</li>
</ul>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Documentation </h2>
<div class="outline-text-2" id="text-4">

<ul>
<li id="sec-4.1">EuLisp definition <br/>
is provided in both HTML and PDF formats:
<ul>
<li>
<a href="Doc/EuLisp-0.991/html/eulisp.html">EuLisp Definition Version 0.991 (HTML)</a>
</li>
<li>
<a href="Doc/EuLisp-0.991/eulisp.pdf">EuLisp Definition Version 0.991 (PDF)</a>
</li>
</ul>
</li>
<li id="sec-4.2">EuLisp-1.0 Proposals <br/>
are in the folowing
<a href="Doc/EuLisp-0.991/Proposals/Proposals.txt">proposal document</a> and
discussed in the minutes of the
<a href="Doc/EuLisp-0.991/Proposals/Meeting_19_11_93.txt">meeting on 19/11/93</a> and in the
<a href="Doc/EuLisp-0.991/Proposals/nov93.txt">preceding</a> and
<a href="Doc/EuLisp-0.991/Proposals/dec93.txt">subsequent</a> Email correspondence.
The following reports are discussed in the above:
<ul>
<li>
<a href="Doc/EuLisp-0.991/Proposals/Reports/eulisp-proposals.ps">eulisp-proposals.ps</a>
</li>
<li>
<a href="Doc/EuLisp-0.991/Proposals/Reports/genarith.ps">genarith.ps</a>
</li>
<li>
<a href="Doc/EuLisp-0.991/Proposals/Reports/adv-genarith.ps">adv-genarith.ps</a>
</li>
<li>
<a href="Doc/EuLisp-0.991/Proposals/Reports/eulisp-ffi.ps">eulisp-ffi.ps</a>

</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Installation </h2>
<div class="outline-text-2" id="text-5">

<ul>
<li>
Pull the latest version from the GitHub repository:
<ul>
<li>
<code>git clone git://github.com/Henry/EuLisp.git</code>
</li>
</ul>
</li>
<li>
"cd" into the <code>EuLisp</code> directory
</li>
<li>
Run
<ul>
<li>
<code>./configure</code>
</li>
</ul>

<p>and check the settings.  Edit the configure file to reflect your system if
necessary and re-run
</p><ul>
<li>
<code>./configure</code>.
</li>
</ul>
</li>
<li>
Run
<ul>
<li>
<code>make</code>
</li>
</ul>
</li>
<li>
If you want to use shared libraries for Youtoo (which we really recommend on
Linux, FreeBSD, Solaris and IRIX), run
<ul>
<li>
<code>make shared</code>
</li>
</ul>

<p>and add the directory <code>.../EuLisp/Lib.${ARCH}</code> to the environment variable
<code>$LD_LIBRARY_PATH</code>.
</p></li>
<li>
You should now be able to run the <code>youtoo</code> executable
<ul>
<li>
<code>Bin.${ARCH}/youtoo</code>
</li>
</ul>

<p>(see next section).
</p>
</li>
</ul>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Getting Started with Youtoo </h2>
<div class="outline-text-2" id="text-6">

<ul>
<li>
Run
<ul>
<li>
<code>Bin.${ARCH}/youtoo -help</code>
</li>
</ul>

<p>to see the compiler options.
</p></li>
<li>
In directory <code>Examples/Misc</code> run
<ul>
<li>
<code>Bin.${ARCH}/youtoo fact -l level1</code>
</li>
</ul>

<p>to compile module fact into a stand-alone
executable. With shared libraries the executable should be less the 40K.
</p></li>
<li>
Run
<ul>
<li>
<code>Bin.${ARCH}/youtoo</code>
</li>
</ul>

<p>without options to start the Youtoo interpreter. The read-eval-print loop
provides extra commands (type <code>help:</code>).
</p></li>
<li>
Further information about running <a href="Youtoo/README.html">Youtoo</a>.
</li>
<li id="sec-6.1">See also <a href="Doc/EuLispIntroRef.html">EuLisp introduction</a>. <br/>

</li>
</ul>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Getting Started with EuXLisp </h2>
<div class="outline-text-2" id="text-7">

<p>EuXLisp need two paths: where to look for the compiled image, and where to
look for modules to load:
</p><ul>
<li id="sec-7.1">Image <br/>
First euxlisp checks the environment variable <code>EU_IMAGE_PATH</code> (a colon
separated list of directory names), then a builtin path, set from
<code>IMAGE_SEARCH_PATH</code> in the Makefile.
</li>
<li id="sec-7.2">Modules <br/>
ditto for environment variable <code>EU_MODULE_PATH</code>, then builtin
<code>MODULE_SEARCH_PATH</code> (e.g., you might want to provide a set of system
supplied modules).
</li>
<li id="sec-7.3">Default settings <br/>
The default built-in settings should work for a default build with the files
in their default locations.
</li>
<li id="sec-7.4">Running the interpreter interactively <br/>
Run
<ul>
<li>
<code>Bin.${ARCH}/euxlisp</code>
</li>
</ul>

<p>without options to start the EuXLisp
interpreter. The read-eval-print loop provides extra commands see
<a href="Doc/EuLispIntroRef.html">EuLisp and EuXLisp introduction</a>.
</p></li>
<li id="sec-7.5">Executing a module <br/>
To execute the module <code>fact</code> in file <code>fact.em</code> run
<ul>
<li>
<code>echo "(!&gt; fact)"  | ../../Bin.${ARCH}/euxlisp -q</code>
</li>
</ul>

<p>The <code>echo</code> pipes the load module <code>!&gt;</code> command to the interpreter.  In the
future there will be a command-line option to execute a module directly.
</p></li>
<li id="sec-7.6">See also <a href="Doc/EuLispIntroRef.html">EuLisp and EuXLisp introduction</a>. <br/>

</li>
</ul>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> <a href="TODO.html">To Do</a> </h2>
<div class="outline-text-2" id="text-8">

</div>
</div>
<div id="postamble">
<p class="date"> Date: 2010-07-01 12:03:12 BST</p>
<p class="creator">HTML generated by org-mode 6.34trans in emacs 23</p>
</div>
</div>
</body>
</html>
